In [1]:
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
engine = create_engine("postgresql://postgres:Sabailand@localhost:5432/PewlettHackard")
connection = engine.connect()

In [3]:
salaries = pd.read_sql("select * from salaries", connection)

In [4]:
salaries.head()

   empno  salary
0  10001   60117
1  10002   65828
2  10003   40006
3  10004   40054
4  10005   78228